GopalSaraf/Practicals/PSDL/include/proc/pic18lf4539.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_AD0_POSN                           equ 0000h
PORTD_AD0_POSITION                       equ 0000h
PORTD_AD0_SIZE                           equ 0001h
PORTD_AD0_LENGTH                         equ 0001h
PORTD_AD0_MASK                           equ 0001h
PORTD_AD1_POSN                           equ 0001h
PORTD_AD1_POSITION                       equ 0001h
PORTD_AD1_SIZE                           equ 0001h
PORTD_AD1_LENGTH                         equ 0001h
PORTD_AD1_MASK                           equ 0002h
PORTD_AD2_POSN                           equ 0002h
PORTD_AD2_POSITION                       equ 0002h
PORTD_AD2_SIZE                           equ 0001h
PORTD_AD2_LENGTH                         equ 0001h
PORTD_AD2_MASK                           equ 0004h
PORTD_AD3_POSN                           equ 0003h
PORTD_AD3_POSITION                       equ 0003h
PORTD_AD3_SIZE                           equ 0001h
PORTD_AD3_LENGTH                         equ 0001h
PORTD_AD3_MASK                           equ 0008h
PORTD_AD4_POSN                           equ 0004h
PORTD_AD4_POSITION                       equ 0004h
PORTD_AD4_SIZE                           equ 0001h
PORTD_AD4_LENGTH                         equ 0001h
PORTD_AD4_MASK                           equ 0010h
PORTD_AD5_POSN                           equ 0005h
PORTD_AD5_POSITION                       equ 0005h
PORTD_AD5_SIZE                           equ 0001h
PORTD_AD5_LENGTH                         equ 0001h
PORTD_AD5_MASK                           equ 0020h
PORTD_AD6_POSN                           equ 0006h
PORTD_AD6_POSITION                       equ 0006h
PORTD_AD6_SIZE                           equ 0001h
PORTD_AD6_LENGTH                         equ 0001h
PORTD_AD6_MASK                           equ 0040h
PORTD_AD7_POSN                           equ 0007h
PORTD_AD7_POSITION                       equ 0007h
PORTD_AD7_SIZE                           equ 0001h
PORTD_AD7_LENGTH                         equ 0001h
PORTD_AD7_MASK                           equ 0080h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RE4_POSN                           equ 0004h
PORTE_RE4_POSITION                       equ 0004h
PORTE_RE4_SIZE                           equ 0001h
PORTE_RE4_LENGTH                         equ 0001h
PORTE_RE4_MASK                           equ 0010h
PORTE_RE5_POSN                           equ 0005h
PORTE_RE5_POSITION                       equ 0005h
PORTE_RE5_SIZE                           equ 0001h
PORTE_RE5_LENGTH                         equ 0001h
PORTE_RE5_MASK                           equ 0020h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h
PORTE_AN5_POSN                           equ 0000h
PORTE_AN5_POSITION                       equ 0000h
PORTE_AN5_SIZE                           equ 0001h
PORTE_AN5_LENGTH                         equ 0001h
PORTE_AN5_MASK                           equ 0001h
PORTE_AN6_POSN                           equ 0001h
PORTE_AN6_POSITION                       equ 0001h
PORTE_AN6_SIZE                           equ 0001h
PORTE_AN6_LENGTH                         equ 0001h
PORTE_AN6_MASK                           equ 0002h
PORTE_AN7_POSN                           equ 0002h
PORTE_AN7_POSITION                       equ 0002h
PORTE_AN7_SIZE                           equ 0001h
PORTE_AN7_LENGTH                         equ 0001h
PORTE_AN7_MASK                           equ 0004h
PORTE_ALE_POSN                           equ 0000h
PORTE_ALE_POSITION                       equ 0000h
PORTE_ALE_SIZE                           equ 0001h
PORTE_ALE_LENGTH                         equ 0001h
PORTE_ALE_MASK                           equ 0001h
PORTE_OE_POSN                            equ 0001h
PORTE_OE_POSITION                        equ 0001h
PORTE_OE_SIZE                            equ 0001h
PORTE_OE_LENGTH                          equ 0001h
PORTE_OE_MASK                            equ 0002h
PORTE_WRL_POSN                           equ 0002h
PORTE_WRL_POSITION                       equ 0002h
PORTE_WRL_SIZE                           equ 0001h
PORTE_WRL_LENGTH                         equ 0001h
PORTE_WRL_MASK                           equ 0004h
PORTE_WRH_POSN                           equ 0003h
PORTE_WRH_POSITION                       equ 0003h
PORTE_WRH_SIZE                           equ 0001h
PORTE_WRH_LENGTH                         equ 0001h
PORTE_WRH_MASK                           equ 0008h
PORTE_CCP2_POSN                          equ 0007h
PORTE_CCP2_POSITION                      equ 0007h
PORTE_CCP2_SIZE                          equ 0001h
PORTE_CCP2_LENGTH                        equ 0001h
PORTE_CCP2_MASK                          equ 0080h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h
PORTE_CCP2E_POSN                         equ 0007h
PORTE_CCP2E_POSITION                     equ 0007h
PORTE_CCP2E_SIZE                         equ 0001h
PORTE_CCP2E_LENGTH                       equ 0001h
PORTE_CCP2E_MASK                         equ 0080h
PORTE_CCP6E_POSN                         equ 0006h
PORTE_CCP6E_POSITION                     equ 0006h
PORTE_CCP6E_SIZE                         equ 0001h
PORTE_CCP6E_LENGTH                       equ 0001h
PORTE_CCP6E_MASK                         equ 0040h
PORTE_CCP7E_POSN                         equ 0005h
PORTE_CCP7E_POSITION                     equ 0005h
PORTE_CCP7E_SIZE                         equ 0001h
PORTE_CCP7E_LENGTH                       equ 0001h
PORTE_CCP7E_MASK                         equ 0020h
PORTE_CCP8E_POSN                         equ 0004h
PORTE_CCP8E_POSITION                     equ 0004h
PORTE_CCP8E_SIZE                         equ 0001h
PORTE_CCP8E_LENGTH                       equ 0001h
PORTE_CCP8E_MASK                         equ 0010h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_PA2E_POSN                          equ 0007h
PORTE_PA2E_POSITION                      equ 0007h
PORTE_PA2E_SIZE                          equ 0001h
PORTE_PA2E_LENGTH                        equ 0001h
PORTE_PA2E_MASK                          equ 0080h
PORTE_PB1E_POSN                          equ 0006h
PORTE_PB1E_POSITION                      equ 0006h
PORTE_PB1E_SIZE                          equ 0001h
PORTE_PB1E_LENGTH                        equ 0001h
PORTE_PB1E_MASK                          equ 0040h
PORTE_PB3E_POSN                          equ 0004h
PORTE_PB3E_POSITION                      equ 0004h
PORTE_PB3E_SIZE                          equ 0001h
PORTE_PB3E_LENGTH                        equ 0001h
PORTE_PB3E_MASK                          equ 0010h
PORTE_PC1E_POSN                          equ 0005h
PORTE_PC1E_POSITION                      equ 0005h
PORTE_PC1E_SIZE                          equ 0001h
PORTE_PC1E_LENGTH                        equ 0001h
PORTE_PC1E_MASK                          equ 0020h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h

